from flask import Flask, render_template, request
import requests
import base64
import os

app = Flask(__name__)


# ==========================================
# 1. ข้อมูลดอกไม้
# ==========================================

flowers = {
    "bougainvillea": {
        "thai": "เฟื่องฟ้า",
        "meaning": "ความรุ่งเรือง ความก้าวหน้า และชีวิตที่สดใส",
        "opportunity": "เลื่อนตำแหน่ง เปิดกิจการใหม่ ขึ้นบ้านใหม่ งานแต่งงาน หรืออวยพรให้ชีวิตประสบความสำเร็จและมีความสุข"
    },

    "carnation": {
        "thai": "คาร์เนชั่น",
        "meaning": "ใความรัก ความนอบน้อม กตัญญูรู้คุณ และรักนิรันดร์",
        "opportunity": "วันแม่ งานมงคลต่าง ๆ เช่น งานรับปริญญา งานแต่งงาน งานขึ้นบ้านใหม่"
    },

    "daisy": {
        "thai": "เดซี่",
        "meaning": "ความบริสุทธิ์ ความไร้เดียงสา และความน่าทะนุถนอม",
        "description": "ให้เพื่อแสดงความห่วงใย หรือร่วมแสดงความยินดีในช่วงเวลาพิเศษ"
    },

    "dandelion": {
        "thai": "แดนดิไลออน",
        "meaning": "วามหวัง อิสระ การเริ่มต้นใหม่ ความเข้มแข็ง และการบอกลา",
        "opportunity": "การบอกลาเพื่อเริ่มต้นใหม่ การให้กำลังใจ หรือ การอวยพรให้สมหวังในคำอธิษฐาน"
    },

    "gardenia": {
        "thai": "พุด",
        "meaning": "ความเจริญรุ่งเรืองและความมั่นคงของชีวิต",
        "opportunity": "บูชาพระเพื่อเสริมสิริมงคลและความมั่งคั่งในครอบครัว, งานฉลองงานแต่งงาน"
    },

    "hibiscus": {
        "thai": "ชบา",
        "meaning": "รักครั้งใหม่ ความเจริญก้าวหน้า ความสำเร็จ",
        "opportunity": "โอกาสแสดงความรัก ความอบอุ่น และความยินดี"
    },

    "hydrangeas": {
        "thai": "ไฮเดรนเยีย",
        "meaning": "ความขอบคุณ ความเข้าใจ และความจริงใจ",
        "opportunity": "โอกาสที่ต้องการสื่อสารความรู้สึกจากใจอย่างอ่อนโยนและจริงใจ"
    },

    "lily": {
        "thai": "ลิลลี่",
        "meaning": "ความบริสุทธิ์ ความรัก ความหวัง และการจากลา",
        "opportunity": "เงานแต่งงาน งานศพ ของขวัญวันเกิดหรือวันครบรอบ ตกแต่งบ้านหรือสถานที่สำคัญ"
    },

    "lotus": {
        "thai": "บัว",
        "meaning": "ความบริสุทธิ์ ความสำเร็จ และปัญญาในพระพุทธศาสนา",
        "opportunity": "พิธีกรรมทางศาสนาพุทธ, การบูชาพระ และวัฒนธรรมไทย, รวมถึงการแพทย์แผนไทย, การตกแต่งสถานที่"
    },

    "orchids": {
        "thai": "กล้วยไม้",
        "meaning": "ความมั่งคั่ง ความสง่างาม และความรักที่มั่นคง",
        "description": "แสดงความยินดีในโอกาสสำคัญ, ให้เป็นของขวัญ, แสดงความปรารถนาอันลึกซึ้ง, แสดงความเคารพต่อผู้ใหญ่หรือบุคคลที่ชื่นชม"
    },

    "peony": {
        "thai": "โบตั๋น",
        "meaning": "ความโรแมนติกและความรักที่สมบูรณ์เต็มเปี่ยมไปด้วยความสุข",
        "opportunity": "การอวยพรให้มั่งคั่ง โชคดี มีเกียรติยศ"
    },

    "rose(pink)": {
        "thai": "กุหลาบสีชมพู",
        "meaning": "ความสง่างาม ความอ่อนโยนและความรักโรแมนติก",
        "opportunity": "วันวาเลนไทน์แบบละมุน วันเกิด วันครบรอบ วันแม่ หรือมอบเพื่อแสดงความยินดีและขอบคุณผู้มีพระคุณ"
    },

    "rose(red)": {
        "thai": "กุหลาบแดง",
        "meaning": "การตกหลุมรักหรือปลื้มใครซักคน",
        "opportunity": "วันวาเลนไทน์ วันครบรอบความสัมพันธ์ การขอแต่งงาน หรือแม้แต่วันธรรมดาที่ต้องการบอกรัก"
    },

    "rose(white)": {
        "thai": "กุหลาบขาว",
        "meaning": "ความรักที่ใสสะอาด บริสุทธิ์ น่าทะนุถนอม",
        "opportunity": "งานแต่งงานเพื่อเริ่มต้นชีวิตคู่ วันครบรอบความสัมพันธ์ การแสดงความยินดีในความสำเร็จ หรือใช้วิตกกาลแสดงความไว้อาลัย"
    },

    "sunflower": {
        "thai": "ทานตะวัน",
        "meaning": "ความสดใส ความหวัง และความมั่นคง",
        "opportunity": "แสดงความยินดีในความสำเร็จ ให้กำลังใจและเยียวยา วันเกิดและวันครบรอบ สารภาพรักหรือเติมความหวาน"
    },

    "tulip": {
        "thai": "ทิวลิป",
        "meaning": "ความรักที่สมบูรณ์และมั่นคง ความสุข",
        "opportunity": "บอกรัก อวยพรให้มีความสุข เช่น วันเกิด วันครบรอบ แสดงความยินดี"
    }
}


# ==========================================
# 2. ข้อมูล Roboflow
# ==========================================

API_URL = os.environ.get("API_URL")


# ==========================================
# 3. หน้าเว็บไซต์
# ==========================================

@app.route("/", methods=["GET", "POST"])
def home():

    result = None
    error = None

    if request.method == "POST":

        # ตรวจสอบว่ามีรูปหรือไม่
        if "image" not in request.files:
            error = "กรุณาเลือกรูปภาพ"

        else:
            image = request.files["image"]

            if image.filename == "":
                error = "กรุณาเลือกรูปภาพ"

            else:
                try:
                    # อ่านรูปและแปลงเป็น Base64
                    image_data = base64.b64encode(
                        image.read()
                    ).decode("utf-8")

                    # ส่งรูปไปให้ AI
                    response = requests.post(
                        API_URL,
                        data=image_data,
                        headers={
                            "Content-Type":
                            "application/x-www-form-urlencoded"
                        }
                    )

                    # รับผลลัพธ์จาก AI
                    data = response.json()

                    # ตรวจสอบว่าตรวจพบดอกไม้หรือไม่
                    if len(data["predictions"]) == 0:

                        error = "AI ไม่พบดอกไม้ที่รู้จัก"

                    else:

                        # เลือกผลที่ Confidence สูงที่สุด
                        prediction = max(
                            data["predictions"],
                            key=lambda x: x["confidence"]
                        )

                        flower_name = prediction["class"]

                        confidence = round(
                            prediction["confidence"] * 100,
                            2
                        )

                        # ค้นหาข้อมูลดอกไม้
                        info = flowers.get(flower_name)

                        if info:

                            result = {
                                "class": flower_name,
                                "thai": info["thai"],
                                "meaning": info["meaning"],
                                "opportunity": info["opportunity"],
                                "confidence": confidence
                            }
                        else:

                            result = {
                                "class": flower_name,
                                "thai": "ยังไม่มีข้อมูล",
                                "meaning": "-",
                                "opportunity": "-",
                                "confidence": confidence
                            }

                except Exception as e:
                    error = str(e)

    return render_template(
        "index.html",
        result=result,
        error=error
    )


# ==========================================
# 4. เริ่มเว็บไซต์
# ==========================================

if __name__ == "__main__":
    app.run(debug=True)